proxy/test/artillery/dev.yaml
config:
  target: 'http://localhost:3060'
  phases:
    - duration: 60
      arrivalRate: 1
      ramup: 1000
      name: 'Warm Up'
    - duration: 60
      arrivalRate: 10
      name: 'Mild Traffic'
    - duration: 60
      arrivalRate: 100
      name: 'Hmm, interesting Traffic'
    - duration: 60
      arrivalRate: 1000
      name: 'OMG, WAT!'
scenarios:
  - flow:
      - get:
          url: '/435234'